<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ДЗ 1. Прості типи даних</title>
</head>
<body>
    <?php $hometask_sting = 'Десять негритят пошли купаться в море'; ?>
    <h1>ДЗ 1. Прості типи даних</h1>
    <h2>Дії з числами</h2>
    <p>Отримати залишок від ділення 7 на 3 = <?= 7 % 3 ?></p>
    <p>Отримати цілу частину ділення 7 и 7 -> <?= intdiv(7 , 7) ?> , та 7 и 15 -> <?= intdiv(7 , 15) ?></p>
    <p>Отримати корінь из 25 = <?= sqrt(25) ?></p>
    <h2>Дії зі строкаи</h2>
    <p>Отримати 4-е слово з фрази - Десять негритят пошли купаться в море -> <?= explode(' ' , $hometask_sting)[3] ?></p>
    <p>Отримати 17-й символ із фрази - Десять негритят пошли купаться в море -> <?= mb_substr($hometask_sting , 16 , 1) ?></p>
    <p>Десять негритят пошли купаться в море -> <?= mb_convert_case($hometask_sting , MB_CASE_TITLE) ?></p>
    <p>Порахувати длину строки - Десять негритят пошли купаться в море -> <?= mb_strlen($hometask_sting) ?></p>
    <h2>Дії з логіческими даними</h2>
    <p>Чи вірно твердження true дорівнює 1 -> <?= true == 1 ? 'Так вiрне' : 'Нi' ?> (Так)</p>
    <p>Чи вірно твердження false тождественно 0 <?= false === 0 ? 'Так вiрне' : 'Нi' ?> (Нi)</p>
    <h2>(Для вирішення цих питань потрібно опанувати рівняння то тотожність у РНР)</h2>
    <p>Яка строка більше three - три -> <?= mb_strlen('three') > mb_strlen('три') ? 'Строка three довша' : 'Строка три довша' ?></p>
    <p>Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2 -> <?= (125 * 13 + 7) > (28*2+223) ? 'Першивай Вираз бiльше' : 'Другий вираз бiльше' ?></p>
</body>
</html>